<?php
// Оператор else выполняется только тогда, когда условие оператора if оценивается как ложное. Но также следует запомнить что выражение внутри оператора if могут выполняться только тогда, когда условное выражение оценивается как истинное (true)

// Ключевое слово else находится сразу после закрывающей фигурной скобки оператора if

// Как вот тут внизу.

$drink = false;

if($drink){
    echo "You will die";
} else {
    echo "You will die anyway";
}
//Данный код выдаст нам текст из тела else, так как мы выше уже упоминали о том, что if условие может выполняться только тогда, когда условное выражение является истинной (true)

//





























?>