<?php
// Тут будет введение в переменные! Переменные это просто контейнеры для хранения, запомни это. В них можно хранить любые данные!

// Так можно называть переменные!
$x = 1;
$X = 2; # Отличается от первой переменной x, даже для кода, это будет уже другая переменная, так как та была строчной, это заглавная, так что с этим внимательней! 
$_x = 2;
$__y = 3;
$_z_ = "Саламалейкум";
$__name__ = "Nika";
$dino1 = "First Nika";
$dino_1 = "Nika 1";
$_dino_1 = "I'm number 1";
$d1_2_3_hello_ = "Still valid"; // этот блок кода скопировал и изменил, нужно запомнить его!



// Так нельзя называть переменные
$1 = "Number 1";
$%abc = "Invalid"; // Спец символы также не используются
// Если глянуть в браузер после того как мы ввели не правильные названия для переменныех, то php сам нам скажет, что так писать нельзя и выведет ошибку, так что не забывай читать ошибки, там подсказки об исправлении!



// Также как ты помнишь, мы просто дали php переменные которые он запомнил, пока ключевое слово echo или return не напишешь, браузер будет бел как только выпавший снежок!




?>